import React, { memo } from 'react';

const page = memo(() => {
    return (
        <div className=' mt-20 flex justify-center items-center flex-col  '> 
            <h1 className=' text-4xl  text-slate-400'>من کیم ؟</h1>
            <p className=' leading-10 bg-zinc-800 p-10 rounded-xl mt-10 text-center w-2/3 center text-slate-500 text-xl'>
            محمد امین رازنهان یک طراح سایت با تجربه و استعداد بالاست. او در سن 18 سالگی به عنوان یک طراح تمام استک (Full Stack Designer) مشغول به کار است. مهارت‌های او شامل Material-UI Icon، Tailwind CSS، HTML، CSS، JavaScript، Redux، TypeScript، React.js و Next.js می‌شود.

او با Material-UI Icon و Tailwind CSS آشنا است که این ابزارها به وی کمک می‌کنند تا طراحی و ظاهر جذاب و حرفه‌ای برای صفحات وب ایجاد کند. همچنین، او تجربه قوی در طراحی وب با استفاده از HTML، CSS و JavaScript دارد، و از این زبان‌ها برای ساخت وبسایت‌های پویا و قابل تعامل استفاده می‌کند.

محمد امین با Redux و TypeScript نیز آشنا است. Redux یک کتابخانه مدیریت وضعیت است که به او امکان می‌دهد وضعیت برنامه را به‌صورت مرکزی مدیریت کند، و TypeScript یک زبان برنامه‌نویسی است که به کدهای JavaScript امکانات بیشتری می‌دهد. با استفاده از این ابزارها، او به‌عنوان یک توسعه دهنده حرفه‌ای می‌تواند برنامه‌های پیچیده و قابل توسعه را بسازد.

علاوه بر این، محمد امین تخصص قوی در React.js و Next.js دارد. React.js یک کتابخانه JavaScript است که برای ساخت واکنش‌گرا و رابط کاربری دوستانه با استفاده از کامپوننت‌ها استفاده می‌شود. Next.js همچنین یک چارچوب ری‌اکت است که امکاناتی مانند SSR (سرور-ساید رندرینگ) و SSR (سرور-ساید رندرینگ) و روتینگ داینامیک را فراهم می‌کند. با استفاده از این ابزارها، او می‌تواند به‌عنوان یک طراح سایت حرفه‌ای وبسایت‌های پیچیده و عالی را طراحی و پیاده‌سازی کند.

            </p>
        </div>
    );
});

export default page;